INSERT INTO [Clother_Shop_Catalog].[dbo].[Товар]
VALUES (1, N'Кросівки NIKE 2000', N'NIKE',N'Сіро-буро-малиновий','45',30.00, N'Унісекс'),
		(2, N'Куртка Chanel Beliver', N'Сhanel', N'Червоний','XL',61.00, N'Для чоловіків'),
		(3, N'Топік', N'Victoria Secret', N'Білий','L',73.00, N'Для жінок'),
		(4, N'Гаманець', N'Pulse', N'Чорний','12',36.00, N'Для жінок'),
		(5, N'Спідниця West', N'Сhanel',N'Зелений','XS',37.00, N'Для жінок'),
		(6, N'Сорочка', N'Сhanel', N'Білий','XL',27.00, N'Для чоловіків'),
		(7, N'Окуляри GF', N'NIKE', N'Рожевий','M',34.00, N'Для жінок'),
		(8, N'Шаровари', N'Victoria Secret', N'Червоний','L',20.00, N'Для чоловіків');
