INSERT INTO [Clother_Shop_Catalog].[dbo].[Клієнт]
VALUES (1, N'Паньчак',N'Ольга',N'Іванівна', '1999-11-30',N'Жіноча',N'м.Львів',N'Промислова ',N'23',982146226),
		(2, N'Ковальчук',N'Наталія',N'Остапівна', '1954-07-24',N'Жіноча',N'м.Бродявки',N'св. Фалафеля',N'47',452383992),
		(3, N'Петренко',N'Віктор',N'Павлович', '1980-05-27',N'Чоловіча',N'м.Севастополь',N'проспект Свободи',N'11',327531123),
		(4, N'Богуслав',N'Василь',N'Вікторович', '1988-03-22',N'Чоловіча',N'с.Турка',N'Бригадеристів',N'88',342345363),
		(5, N'Шквальтик',N'Єва',N'Семенівна', '1943-02-11',N'Жіноча',N'м.Севєродонецьк',N'Стрільців',N'22',925386112),
		(6, N'Штик',N'Лілія',N'Петрівна', '2003-11-09',N'Жіноча',N'м.Львів',N'Липинського',N'63a',984422556);


		