SELECT * from Клієнт
ORDER BY Місто,Вулиця,[Номер будинку] ASC;

SELECT Магазин.Назва
,Магазин.Сайт
,[Дизайнер товару].Прізвище
,[Дизайнер товару].Рейтинг
,Клієнт.Прізвище
,Клієнт.[Ім’я]
,Замовлення.[Дата замовлення]
from (Магазин INNER JOIN Замовлення ON Замовлення.[Код магазину]=Магазин.[Код магазину])
INNER JOIN Клієнт ON Клієнт.[Код клієнта]=Замовлення.[Код клієнта]
INNER JOIN [Дизайнер товару] ON [Дизайнер товару].[Код дизайнера товару]=Замовлення.[Код дизайнера товару]
WHERE YEAR( [Дата замовлення])=2020
ORDER BY Рейтинг DESC;

SELECT   [Бренд], COUNT([Код товару]) as Кількість from Товар
GROUP BY Товар.[Бренд];

