SELECT [Дизайнер товару].[Прізвище]
      ,[Дизайнер товару].[Ім'я]
      ,[Дизайнер товару].[По батькові]
      ,[Дизайнер товару].[Дата народження]
      ,[Дизайнер товару].[Рейтинг]
	  ,[Замовлення].[Код дизайнера товару]
	  ,[Замовлення].[Код товару]
	  ,[Замовлення].[Дата замовлення]
	  ,[Товар].Бренд
	  ,[Товар].Колір
	  ,[Товар].Вартість
  FROM ([Дизайнер товару] INNER JOIN Замовлення ON Замовлення.[Код дизайнера товару]=[Дизайнер товару].[Код дизайнера товару]) 
  INNER JOIN [Товар] ON [Товар].[Код товару]=Замовлення.[Код товару]
  WHERE [Рейтинг] = ANY (SELECT [Рейтинг] FROM [Дизайнер товару] )
  AND Бренд LIKE N'N%'
  AND  MONTH([Дата замовлення]) BETWEEN 1 AND 5;



  SELECT * 
FROM (Клієнт LEFT JOIN Замовлення ON Замовлення.[Код клієнта]=Клієнт.[Код клієнта])
WHERE [Код замовлення] IS NOT NULL 
AND EXISTS (SELECT Магазин.[Код магазину] FROM Магазин);


SELECT *
 FROM [Clother_Shop_Catalog].[dbo].[Товар]
WHERE [Clother_Shop_Catalog].[dbo].[Товар].[Бренд] IN (N'Chanel',N'NIKE',N'Victoria Secret') 
AND [Код товару] =  ALL(SELECT [Код товару] From [Clother_Shop_Catalog].[dbo].[Товар]
WHERE [Clother_Shop_Catalog].[dbo].[Товар].[Вартість] BETWEEN  29 AND 31);
