SELECT  [Громадянство], AVG(Рейтинг) as Рейтинг from [Дизайнер товару]
GROUP BY [Громадянство]
HAVING AVG(Рейтинг)>5;

SELECT  MAX(Вартість*[Кількість товару]) as Максимальна_вартість from Замовлення,Товар
WHERE  Замовлення.[Код товару]=Товар.[Код товару];

SELECT Товар.Бренд, SUM([Кількість товару])as Кількість from Замовлення
INNER  JOIN Товар  on Товар.[Код товару]=Замовлення.[Код товару]
GROUP BY Товар.Бренд;

SELECT  YEAR(getdate())- AVG(YEAR([Дата народження])) as Середній_Вік_Клієнта from Клієнт;

SELECT  STDEV (Вартість) as Середнє_квадратичне_відхилення_ціни  from Товар;